# Градиент

## Оглавление
- [Определение базовое](#определение-базовое)
- - [Определение на примере](#определение-на-примере)
- [Алгоритм вычисления](#алгоритм-вычисления-градиента-функции-n-переменных-в-точке-x)
- - [Пример на Python](#пример-на-python)
- [Дополнительные материалы](#дополнительные-материалы) 

## Определение базовое

Это вектор с началом в точке М, координатами которого являются частные производные фунции:

$$
\begin{align}
grad \ F = \sum_{i=1}^{n}{\frac{\partial{F}}{\partial{x_i}}*e_i}\\
\\где\ e_i\ -\ единичный\ вектор,\ направленный\ вдоль\ оси\ x_i 
\end{align}
$$

Другими словами, это вектор, указывающий направление наибыстрейщего роста функции

### Определение на примере

Для функции 3 переменных 

$$
u=f(x,y,z)
$$

градиент функции равен:
$$
grad\ u= \frac{\partial{u}}{\partial{x}}i\ +\ \frac{\partial{u}}{\partial{y}}j\ +\ \frac{\partial{u}}{\partial{z}}k
$$

## Алгоритм вычисления градиента функции n переменных в точке x

$$
\begin{align}
grad\ F(x_1,x_2,...,x_n) = \sum_{i=1}^{n} \frac{F(x + e_i * h) - F(x - e_i * h)}{2*h}\\
x\ -\ точка(вектор\ размерности\ n)\ в\ которой\ ищем\ градиент \\
e_i\ -\ единичный\ вектор,\ направленный\ вдоль\ оси\ x_i\\
h\ -\ изменение\ аргумента\ функции
\end{align}
$$

### Пример на Python

```python
import numpy as np
from typing import Callable

H = 0.000_001

def f(x : np.array) -> float:
    return x[0] * x[0] + x[1] * x[1]

def grad(func : Callable, x : np.array, h=H) -> np.array:
    """градиент функции func от n переменных в точке x"""
    n = len(x)
    grad = np.empty(n, dtype=float)
    e = np.zeros(n, dtype=int)
    for i in range(n):
        e[i] = 1
        e[i-1] = 0
        grad[i] = (func(x + e * h) - func(x - e * h)) / (2 * h)
    return grad

if __name__ == '__main__':
    #проверяем экстремум (0,0,0) grad F == {0,0}
    point = np.array([0.0, 0.0])
    print(grad(f, point))

    #проверяем точку (1,1,2) grad F == {2,2}
    point = np.array([1.0, 1.0])
    print(grad(f, point))
```

## Дополнительные материалы
 - [Производная функции](Derivative.md)